tsung_logs/20191122-1757/simple.xml
<?xml version="1.0"?><tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="wisowls.9kzrfzjyhm.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
	<users arrivalrate="1" unit="second"/>
 </arrivalphase>
 <arrivalphase phase="2" duration="30" unit="second">
 <users arrivalrate="2" unit="second"/>
 </arrivalphase>
 <arrivalphase phase="3" duration="30" unit="second">
 <users arrivalrate="4" unit="second"/>
 </arrivalphase>
 <arrivalphase phase="4" duration="30" unit="second">
 <users arrivalrate="8" unit="second"/>
 </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

	<thinktime value="2" random="true"/>
	
	<request>
		<http url="/signup" version="1.1" method="GET"/>
	</request>

	<thinktime value="2" random="true"/>

	<setdynvars sourcetype="random_number" start="1000" end="9999999">
		<var name="random_email"/>
	</setdynvars>

	<request subst="true">
        <dyn_variable name="created_community_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_community_id" re="[Ll]ocation: http://.*/communities/(.*)\r"/>
        <http url="/users" version="1.1" method="POST" contents="community%5Bname%5D=community_name_%%_random_community_name%%&amp;commit=Create+Community">
        </http>
      </request>

    </session>
  </sessions>
</tsung>